{
    "commandDescription": "creates a new custom metadata type in the current project",
    "commandLongDescription": "Creates a new custom metadata type in the current project.",

    "nameFlagDescription": "unique object name for the custom metadata type",
    "nameFlagLongDescription": "The unique name of the object in the API. This name can contain only underscores and alphanumeric characters, and must be unique in your org. It must begin with a letter, not include spaces, not end with an underscore, and not contain two consecutive underscores.",

    "labelFlagDescription": "label for the custom metadata type",
    "labelFlagLongDescription": "A label for the custom metadata type.",
    "labelFlagExample": "Custom Type",

    "plurallabelFlagDescription": "plural label for the custom metadata type; if blank, uses label",
    "plurallabelFlagLongDescription": "A plural label for the custom metadata type. If this flag is missing or blank, the singular label is used as the plural label.",
    "plurallabelFlagExample": "Custom Types",

    "visibilityFlagDescription": "visibility for the type",
    "visibilityFlagLongDescription": "The visibility for the type.",

    "outputDirectoryFlagDescription": "the directory to store the newly created files",
    "outputDirectoryFlagLongDescription": "The directory to store the newly created files. The location can be an absolute path or relative to the current working directory. The default is the current directory.",

    "successResponse" : "Created custom metadata type with object name '%s', label '%s', plural label '%s', and visibility '%s' at '%s'.",
    "errorNoOrgResults": "No results found for the organization '%s'.",
    "errorNotValidAPIName" :"'%s' is not a valid API name for a custom metadata object. Metadata names can contain only underscores and alphanumeric characters, must begin with a letter, cannot end with an underscore or contain two consecutive underscore characters.",
    "errorNotValidLabelName" : "'%s' is not a valid label for a custom metadata object.",
    "errorNotValidPluralLabelName" : "'%s' is not a valid plural label for a custom metadata object.",
    "targetDirectory" : "target dir = %s",
    "fileCreated": "   create %s",
    "fileUpdate":"   update %s"
}
